testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/10/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 63.63ms, 157.16 req/s, 149.94MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 427 sent, 8242 received
                     min         max         mean         sd        +/- sd
time for request:    37.53ms     57.99ms     46.92ms      6.95ms    70.00%
time for connect:     4.22ms     25.71ms     14.84ms      7.28ms    60.00%
time to 1st byte:    25.31ms     28.14ms     26.74ms      1.07ms    60.00%
req/s           :      15.79       16.61       16.18        0.23    70.00%